Figure/Figure 3/data/kwSST/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Assumes the flow is at rest intially but later affecte by a fixed velocity gradianet impased at the inlet
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{

    inlet
    {
        type            cyclic;
    }
    
    outlet
    {
        type            cyclic;
    }
    
    top 
    {
        type            symmetryPlane;
    }

    bottom 
    {
                        type          fixedValue;
                        value        uniform (0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
