Figure/Figure 3/data/kwSST/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            cyclic;
    }
    
    outlet
    {
        type            cyclic;
    }
    
    top 
    {
        type            symmetryPlane;
    }
   
    bottom 
    {
        type             zeroGradient;
    }
  
    frontAndBack 
    {
        type            empty;
    }

  }
// ************************************************************************* //
