Figure/Figure 3/data/kwSST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    
    outlet
    {
        type            cyclic;
    }
    
    top 
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.00084;
        Cs              uniform 0.5;
        value           uniform 0;
    } 

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
